print("Hello, 'world'")  # // - целочисленное деление, / - деление
print(type("Hello, world"))  # смотрим к какому типу относится данное число
print('Hello,' + ' world!') # concatenate
print('1' + '1')
print(type(True), type(False))  # boolean
print(5 > 10, 10 > 5)
print(1, 2, 3, 'hello world', True) # можем выводить разные типы данных
print(5 < 5, 5 >= 5, 5 == 5, 5 != 5)  # в ответе False или True
print(5 == 5 and 5 < 4)  # and - строгий оператор
print(5 == 5 or 5 < 4)  # or - не строгий оператор
print(type(float('5'))) # int - переводим 5 из текстового типа данных в числовой
# and - важно чтобы обе части были верны
# or - важно чтобы хотя бы одно выражение было правдивым
# - однострочный комментарий
# % - остаток от деления
# ** - возведение в степень
# числа не изменяемые данные
# Для работы с текстом ставим кавычки ""
# str - string (строка)
# int - integer (целое число)
# float - число с плавающей запятой
# bool - логический тип данных
